Revit 2024 API
LabelUtils.GetLabelFor Method (BuiltInParameterGroup)
 Gets the user-visible name for a BuiltInParameterGroup.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the `GetLabelForGroup(ForgeTypeId)` method instead.")]
public static string GetLabelFor(
	BuiltInParameterGroup builtInParamGroup
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the `GetLabelForGroup(ForgeTypeId)` method instead.")> _
Public Shared Function GetLabelFor ( _
	builtInParamGroup As BuiltInParameterGroup _
) As String
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the `GetLabelForGroup(ForgeTypeId)` method instead.")]
public:
static String^ GetLabelFor(
	BuiltInParameterGroup builtInParamGroup
)
Parameters
builtInParamGroup
Type: Autodesk.Revit.DB.BuiltInParameterGroup
 The BuiltInParameterGroup to get the user-visible name.
Remarks
 The name is obtained in the current Revit language.
See Also
LabelUtils Class
GetLabelFor Overload
Autodesk.Revit.DB Namespace